{
    "fields": {
        "accessible": {
            "rightLabel": "Enable accessibility features",
            "helper": "Changes the behaviour of the settings screens to make them more accessible. This will dynamically change this page, but you still need to save the setting."
        },
        "startup": {
            "collapsible": true,
            "collapsed": true,
            "fields": {
                "startupdelay": {
                    "helper": "Add a delay before the Cumulus tries to start reading the station. Set to zero to disable. Note if a start-up ping host is specified, this timer will run before the ping. Time in seconds"
                },
                "startupdelaymaxuptime" : {
                    "helper": "The maximum system uptime to apply the delay. If the system uptime is greater than this value then the delay will not be applied. Set to zero to disable (delay will always be applied). Time in seconds"
                },
                "startuphostping": {
                    "helper": "Add a hostname or IP to address to ping at start-up. Cumulus waits until the ping is successful before trying to read from your station. Leave blank to disable"
                },
                "startuppingescape": {
                    "helper": "Specify a time after which if no ping response is received carry on starting Cumulus MX anyway. Ignored if the host ping field is blank. Time in minutes"
                },
                "startuptask": {
                    "collapsible": true,
                    "collapsed": true,
                    "fields": {
                        "task": {
                            "helpers": [
                                "Enter a task (program/scripts etc) to run before Cumulus MX starts up fully",
                                "Note: You must enter a full path to the task, unless it is in the Cumulus MX root folder"
                            ]
                        },
                        "taskparams": {
                            "helper": "Optional parameters for the start-up task"
                        },
                        "wait": {
                            "rightLabel": "Wait for task to complete",
                            "helper": "Should Cumulus wait for the start-up task to complete (terminate) before continuing?"
                        }
                    }
                }
            }
        },
        "shutdown": {
            "collapsible": true,
            "collapsed": true,
            "fields": {
                "datastoppedexit": {
                    "rightLabel": "Exit on data stopped",
                    "helpers": [
                        "If a 'data stopped' event occurs because some or all of the station data is not updating, then exit Cumulus MX to prevent a flat line being logged",
                        "Note: the data stopped event can be suppressed by the station 'No sensor check' setting"
                    ]
                },
                "datastoppedmins": {
                    "helper": "Specify the number of minutes to wait after the data stopped event for it to clear before exiting",
                    "dependencies": {
                        "datastoppedexit": true
                    }
                },
                "shutdowntask": {
                    "collapsible": true,
                    "collapsed": true,
                    "fields": {
                        "task": {
                            "helpers": [
                                "Enter a task (program/scripts etc) to run when Cumulus MX is about to exit",
                                "Note: You must enter a full path to the task, unless it is in the Cumulus MX root folder",
                                "Note: Cumulus does not wait for this task to complete"
                            ]
                        },
                        "taskparams": {
                            "helper": "Optional parameters for the shutdown task, this can string can contain web tags"
                        }
                    }
                }
            }
        },
        "logging": {
            "collapsible": true,
            "collapsed": true,
            "fields": {
                "debuglogging": {
                    "rightLabel": "Debug logging",
                    "helper": "Enable extra diagnostic logging to the MX diags files."
                },
                "datalogging": {
                    "rightLabel": "Data logging",
                    "helper": "Enable diagnostic logging to the MX diags files of data transfers from the station."
                },
                "ftplogging": {
                    "rightLabel": "FTP logging",
                    "helpers": [
                        "Log FTP activity to ftplog.txt and to MX diags for diagnostic purposes",
                        "Note: SFTP only logs to the MX diags file and PHP upload logging is included in debug/data logging"
                    ]
                },
                "emaillogging": {
                    "rightLabel": "Email logging",
                    "helper": "Enable extra SMTP logging to the smtp.log file in the MXdiags folder."
                },
                "spikelogging": {
                    "rightLabel": "Spike logging",
                    "helper": "Enable the logging of data spike and limit violations to MX diags files."
                }
            }
        },
        "options": {
            "collapsible": true,
            "collapsed": true,
            "fields": {
                "stopsecondinstance": {
                    "rightLabel": "Stop second instance",
                    "helper": "Prevent multiple instances of Cumulus running. This setting requires a restart to take effect"
                },
                "listwebtags": {
                    "rightLabel": "List web tags",
                    "helper": "Every time Cumulus MX is started it will create listing of all web tags in the 'WebTags.txt' file."
                },
                "use24hrtime": {
                    "rightLabel": "Use 24hr time",
                    "helper": "Default enabled shows 24 hour times on the dashboard, disabling shows 12 hour times with AM/PM"
                }
            }
        },
        "culture": {
            "collapsible": true,
            "collapsed": true,
            "fields": {
                "removespacefromdateseparator": {
                    "rightLabel": "Remove space character from date separators (if present)",
                    "helpers": [
                        "CAUTION: Changing this may render your existing data files unreadable by Cumulus MX",
                        "Globally change the default date separator for your locale by removing any spaces. Eg. change 'dd. mm. yy' to 'dd.mm.yy'"
                    ]
                }
            }
        }
    }
}