{
    "_LAST_MODIFIED": "Last modified: 2025/08/25 11:15:42",
    "OFFSET": "Offset",
    "OFFSET_HELPER": "Adds or subtracts a constant value from the raw reading, this shifts the value a constant amount",
    "MULTIPLIER": "Multiplier",
    "MULTIPLIER_HELPER": "Multiply the raw reading by a constant, this affects the slope of the response",
    "MULTIPLIER2": "Multiplier ^2",
    "MULTIPLIER2_HELPER": "The Multiplier ^2 affects the curve of the correction",
    "SPIKE": "Spike removal",
    "SPIKE_HELPER": "If the change in the raw value between consecutive readings is greater than this value it will be ignored",
    "LIMIT_MIN": "Min. limit",
    "LIMIT_MIN_HELPER": "If the raw value is less this limit value it will be ignored",
    "LIMIT_MAX": "Max. limit",
    "LIMIT_MAX_HELPER": "If the raw value is greater than this limit value it will be ignored",
    "PRESS_HELPER1": "Only applied to the Sea Level Pressure value supplied by your station",
    "PRESS_HELPER2": "If the option for Cumulus calculated SLP is enabled, then this calibration will NOT be applied",
    "STN_PRESS_HELPER1": "Only applied to the station (or raw/absolute) pressure value supplied by your station",
    "STN_PRESS_HELPER2": "The altimeter pressure is dervied from the calibrated value",
    "STN_PRESS_HELPER3": "If the option for Cumulus calculated SLP is enabled, then this the calibration that will be applied",
    "RAIN_RATE_SPIKE": "Rain rate spike removal",
    "RAIN_HOUR_SPIKE": "Rain per hour spike removal",
    "MIN_INCREMENT": "Minimum increment",
    "MIN_INCREMENT_HELPER1": "The minimum increase in the laser depth value between consecutive readings for the value to added to the daily snowfall accumulation",
    "MIN_INCREMENT_HELPER2": "NOTE: This is set in laser measurement units, not snow depth units",
    "SNOW_SPIKE_HELPER1": "If the change in the laser depth value between consecutive readings is greater than this value it will be ignored and not added to the daily snow accumulation"
}